# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [4]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/JonasZimmer1994/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: False

In [5]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv(path+'/DATA/US_Baby_Names_right.csv')

NameError: name 'pd' is not defined

### Step 4. See the first 10 entries

In [120]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [121]:
baby_names.drop(columns=['Unnamed: 0', 'Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [122]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [ ]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [125]:
print(len(names.count()))

17632

### Step 9. What is the name with most occurrences?

In [126]:
baby_names['Name'].value_counts().head(1)

Riley    1112
Name: Name, dtype: int64

### Step 10. How many different names have the least occurrences?

In [128]:
nameCount = baby_names['Name'].value_counts().rename_axis('Name').reset_index(name='Occurences')
nameCount

          Name  Occurences
0        Riley        1112
1        Avery        1080
2       Jordan        1073
3       Peyton        1064
4       Hayden        1049
...        ...         ...
17627   Daesha           1
17628   Batool           1
17629  Gabrian           1
17630   Itzela           1
17631   Copper           1

[17632 rows x 2 columns]

In [130]:
leastOccurence = nameCount[nameCount['Occurences']== 1]
leastOccurence.count()

Name          3682
Occurences    3682
dtype: int64

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

### Step 13. Get a summary with the mean, min, max, std and quartiles.